In [1]:
# 0. scientist.csv
# 1. df로 읽어들이고
# 2. df의 전체 데이터셋 타입을 확인
# 3. df의 컬럼리스트를 확인
# 4. df의 값을 확인
# 5. df의 맨 마지막에 price항목을 추가(값은 임의대로 넣음. int)
# 6. df의 맨 마지막에 percent항목을 추가(값의 임의대로 넣음. float)
# 7. df의 맨 마지막에 sale항목을 추가(price * percent)
# 8. df의 Name컬럼 추출
# 9. df의 인덱스 확인
# 10. df의 Name컬럼의 값이 Rosaline인 행 추출
# 11. df의 Name컬럼 중 3~5사이의 행 추출
# 12. df의 Name, Died컬럼 모든 행 추출
# 13. df의 Born컬럼부터 끝컬럼까지 모든 행 추출
# 14. df의 Born, Age컬럼의 5~7행 추출
# 15. df.shape을 통해 몇행 몇열인지 확인해보세요.
# 16. df의 숫자 데이터의 상세정보 확인
# 17. Nurse라는 스트링 추출(index와 컬럼명을 사용)
# 18. Alan Turing이라는 스트링 추출(index와 컬럼명을 사용)
# 19. Biologist를 Scientist로 변경
# 20. df의 변경된 내용은 수시로 프린트해볼 것.

In [53]:
import pandas as pd

In [78]:
df = pd.read_csv('scientists.csv')
df
# 열의 이름, 컬럼의 이름, 변수명(변수) : Name	Born	Died	Age	Occupation

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [82]:
df.iloc[0,0]

'Rosaline Franklin'

In [84]:
df[df['Name'].str.contains('Rosaline|Alan')]

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [55]:
df.shape

(8, 5)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [ ]:
# info() : 항목별 갯수와 datatype

In [57]:
df.head(2)

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician

In [59]:
df.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
# head(10), tail(5) : 일부분

In [ ]:
# describe(include='object')

In [60]:
df.count() #항목별 전체값의 개수(빈도)

Name          8
Born          8
Died          8
Age           8
Occupation    8
dtype: int64

In [61]:
df['Occupation'].value_counts() #각각의 값들의 빈도수

Chemist               2
Statistician          1
Nurse                 1
Biologist             1
Physician             1
Computer Scientist    1
Mathematician         1
Name: Occupation, dtype: int64

In [63]:
df['Age'].value_counts()

37    1
61    1
90    1
66    1
56    1
45    1
41    1
77    1
Name: Age, dtype: int64

In [64]:
df.T

,0,1,2,3,4,5,6,7
Name,Rosaline Franklin,William Gosset,Florence Nightingale,Marie Curie,Rachel Carson,John Snow,Alan Turing,Johann Gauss
Born,1920-07-25,1876-06-13,1820-05-12,1867-11-07,1907-05-27,1813-03-15,1912-06-23,1777-04-30
Died,1958-04-16,1937-10-16,1910-08-13,1934-07-04,1964-04-14,1858-06-16,1954-06-07,1855-02-23
Age,37,61,90,66,56,45,41,77
Occupation,Chemist,Statistician,Nurse,Chemist,Biologist,Physician,Computer Scientist,Mathematician

In [65]:
df.sort_index() #오름차순(작--->큰)

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [66]:
df.sort_index(ascending=False) #내림차순(descending)

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [ ]:
# df[항목명].value_counts() : 항목의 개수, 타입

In [ ]:
# df.T : 행, 열 전환

In [ ]:
    # df[항목명].astype('int32') : 항목의 타입 변환(float32, str, category, datetime)

In [ ]:
# df.sort_index(), df.sort_index(ascending=False) : index로 정렬

In [68]:
# df.sort_values(by='age') : age컬럼으로 오름차순 정렬 
df.sort_values(by='Age')

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse

In [85]:
df.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [95]:
df['Born'] = pd.to_datetime(df['Born'])
df['Died'] = pd.to_datetime(df['Died'])

In [96]:
df.dtypes

Name                  object
Born          datetime64[ns]
Died          datetime64[ns]
Age                    int64
Occupation            object
dtype: object

In [69]:
df.sort_values(by='Age', ascending=False)

                   Name        Born        Died  Age          Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [ ]:
# df.sort_values(by='age', ascending=False)

In [ ]:
# df.sort_values(by=['fare', 'age'])

In [2]:
# df.sort_values(by=['fare', 'age'], ascending=[False, True])

In [77]:
# condition = df['who'] == 'man'
# df[condition], df.loc[condition]
# df[condition]['age']
# df[condition]['age'] = 2 (허용x)
# df.loc[condition, 'age'] = 2 (허용o)
result = df[df['Age'] == 61]
print(type(result))
print(result)
print(result['Occupation'])
print('---------------')
print(result[['Born','Occupation']])

<class 'pandas.core.frame.DataFrame'>
             Name        Born        Died  Age    Occupation
1  William Gosset  1876-06-13  1937-10-16   61  Statistician
1    Statistician
Name: Occupation, dtype: object
---------------
         Born    Occupation
1  1876-06-13  Statistician

In [ ]:
# 조건1 정의
# condition1 = (df['fare'] > 30)

# 조건2 정의
# condition2 = (df['who'] == 'woman')

In [ ]:
# df.loc[condition1 & condition2]

In [ ]:
# df.loc[condition1 | condition2]

In [4]:
import seaborn as sns

In [98]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [99]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [ ]:
# 나이가 30살 이상 남자 승객 조건 필터링
# fare를 많이 낸 순서로 내림차순 정렬
# 상위 10개를 출력

In [102]:
result2 = df[df['age'] >= 30] #결과는 df
result2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
873,0,3,male,47.0,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [103]:
result2['age']

1      38.0
3      35.0
4      35.0
6      54.0
11     58.0
       ...
873    47.0
879    56.0
881    33.0
885    39.0
890    32.0
Name: age, Length: 330, dtype: float64

In [104]:
result2[['age', 'pclass']]

      age  pclass
1    38.0       1
3    35.0       1
4    35.0       3
6    54.0       1
11   58.0       1
..    ...     ...
873  47.0       3
879  56.0       1
881  33.0       3
885  39.0       3
890  32.0       3

[330 rows x 2 columns]

In [ ]:
df[df['age'] >= 30]['age']

In [14]:
df[df['age'] >= 30]['age'].value_counts().head()

30.0    25
36.0    22
35.0    18
32.0    18
31.0    17
Name: age, dtype: int64

In [15]:
df.sort_values(by='fare', ascending=False).head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
311,1,1,female,18.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
742,1,1,female,21.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
118,0,1,male,24.0,0,1,247.5208,C,First,man,True,B,Cherbourg,no,False

In [16]:
result1 = df.sort_values(by='fare', ascending=False).head(10)
result1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
311,1,1,female,18.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
742,1,1,female,21.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
118,0,1,male,24.0,0,1,247.5208,C,First,man,True,B,Cherbourg,no,False

In [18]:
result1.sort_index(ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
742,1,1,female,21.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
311,1,1,female,18.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
118,0,1,male,24.0,0,1,247.5208,C,First,man,True,B,Cherbourg,no,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False

In [ ]:
# 나이가 20살 이상 40살 미만인 승객
# pclass가 1등급 혹은 2등급인 승객
# 열(column)은 survived, pclass, age, fare 만 나오게 출력
# 10개만 출력

In [21]:
df[(df['age'] >= 20) & (df['age'] < 40)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [27]:
result2 = df[df['pclass'].isin([1, 2])]  #df[df['pclass'] < 3]
result2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [33]:
df[df['pclass'].isin([1, 2])][['survived', 'pclass', 'age', 'fare']][:5]

    survived  pclass   age     fare
1          1       1  38.0  71.2833
3          1       1  35.0  53.1000
6          0       1  54.0  51.8625
9          1       2  14.0  30.0708
11         1       1  58.0  26.5500

In [30]:
result2[['survived', 'pclass', 'age', 'fare']]

     survived  pclass   age     fare
1           1       1  38.0  71.2833
3           1       1  35.0  53.1000
6           0       1  54.0  51.8625
9           1       2  14.0  30.0708
11          1       1  58.0  26.5500
..        ...     ...   ...      ...
880         1       2  25.0  26.0000
883         0       2  28.0  10.5000
886         0       2  27.0  13.0000
887         1       1  19.0  30.0000
889         1       1  26.0  30.0000

[400 rows x 4 columns]

In [35]:
df['pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64

In [37]:
df[['pclass', 'age']]

     pclass   age
0         3  22.0
1         1  38.0
2         3  26.0
3         1  35.0
4         3  35.0
..      ...   ...
886       2  27.0
887       1  19.0
888       3   NaN
889       1  26.0
890       3  32.0

[891 rows x 2 columns]

In [ ]:
# sample['name'].isin(['kim', 'lee'])

In [ ]:
# sample.isin(['kim', 'lee'])
# condition = sample['name'].isin(['kim', 'lee'])
# sample.loc[condition]

In [ ]:
# df1['VIP'] = True

In [ ]:
# df1.drop(1) : 행삭제

In [ ]:
# df1.drop(df1.index[0:10])

In [ ]:
# df1.drop(df1.index[[1, 3, 5, 7, 9]])

In [ ]:
# df1.drop('class', axis=1) ==> df1.drop('class', 1)

In [ ]:
# df1.drop(['who', 'deck', 'alive'], axis=1)
# df1.drop(['who', 'deck', 'alive'], axis=1, inplace=True)

In [ ]:
# df1 = df.copy()

In [ ]:
# df1['round'] = round(df1['fare'] / df1['age'], 2)

In [38]:
result2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [40]:
result2['pclass'].head(3)

1    1
3    1
6    1
Name: pclass, dtype: int64

In [42]:
result2.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [45]:
result2[['pclass', 'age', 'who']]

     pclass   age    who
1         1  38.0  woman
3         1  35.0  woman
6         1  54.0    man
9         2  14.0  child
11        1  58.0  woman
..      ...   ...    ...
880       2  25.0  woman
883       2  28.0    man
886       2  27.0    man
887       1  19.0  woman
889       1  26.0    man

[400 rows x 3 columns]

In [46]:
result2[['pclass', 'age', 'who']].value_countsounts()

pclass  age   who
2       24.0  woman    7
        34.0  man      6
1       36.0  man      6
        35.0  woman    6
2       23.0  man      6
                      ..
1       53.0  woman    1
        51.0  woman    1
        47.0  woman    1
        45.5  man      1
2       70.0  man      1
Length: 171, dtype: int64

In [48]:
result2[['pclass', 'age']].value_counts()

pclass  age
2       34.0    10
        24.0    10
        28.0     9
1       36.0     9
        35.0     9
                ..
2       6.0      1
        7.0      1
        13.0     1
        14.0     1
        70.0     1
Length: 114, dtype: int64

In [49]:
result2['pclass'].value_counts()

1    216
2    184
Name: pclass, dtype: int64

In [50]:
result2.count() #df전체에 있는 항목별 행 갯수만!

survived       400
pclass         400
sex            400
age            359
sibsp          400
parch          400
fare           400
embarked       398
class          400
who            400
adult_male     400
deck           191
embark_town    398
alive          400
alone          400
dtype: int64

In [52]:
result2['pclass'].value_counts() #항목 내에 있는 값들의 빈도수

1    216
2    184
Name: pclass, dtype: int64